In [1]:
import pandas as pd

In [3]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [6]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [8]:
df.sort_index(inplace = True)

In [9]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [10]:
df.sort_index(inplace =True, axis =1)

In [11]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [12]:
df.sort_values(by ='X', inplace = True)

In [13]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [14]:
df.sort_index()
df.sort_index(axis = 1)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [15]:
data = [[9,6,3], [8,5,2], [7,4,1]]

In [16]:
df = pd.DataFrame(data, list('ZYX'), list('CBA'))

In [17]:
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [18]:
df.sort_index()
df.sort_index(axis = 1)
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [19]:
data =[['Ary', 'M', 21], ['Cátia','F',19],['Carlos', 'M', 50]]

In [29]:
df = pd.DataFrame(data, list('012'), list(['Nome','Sexo','Idade']))

In [30]:
df

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50

In [31]:
df_B= df.sort_values(by =['Sexo','Nome'])

In [32]:
df_B

     Nome Sexo  Idade
1   Cátia    F     19
0     Ary    M     21
2  Carlos    M     50